/**
 ****************************************************************************************************
 * @file        adc.h
 * @version     V1.0
 * @date        2025-01-13
 * @brief       ADC驱动代码
 ****************************************************************************************************
 * @attention
 * 
 * 
 ****************************************************************************************************
 */

#ifndef __ADC_H
#define __ADC_H

#include "main.h"

/* 函数声明 */
void adc_init(void);                                                /* 初始化ADC */
uint32_t adc_get_result(uint32_t channel);                          /* 获取ADC结果 */
uint32_t adc_get_result_average(uint32_t channel, uint8_t times);   /* 均值滤波获取ADC结果 */

#endif
