/**
 ****************************************************************************************************
 * @file        rng.h
 * @version     V1.0
 * @date        2025-01-13
 * @brief       RNG驱动代码
 ****************************************************************************************************
 * @attention
 * 
 * 
 ****************************************************************************************************
 */

#ifndef __RNG_H
#define __RNG_H

#include "main.h"

/* 函数声明 */
uint8_t rng_init(void);                                 /* 初始化随机数发生器 */
uint32_t rng_get_random(void);                          /* 获取随机数 */
int32_t rng_get_random_range(int32_t min, int32_t max); /* 获取指定范围的随机数 */

#endif
